from random import *  # імпортую всі команди з random

i = 0
random_list = [randint(0, 100) for i in range(100)]

print(f"list before bubble sort: {random_list[:10]}")

# фактор зменшення справляє великий ефект на швидкість алгоритму сортування гребінцем. В оригінальній статті, автор пропонує значення 1.3 після багатьох експериментів з іншими значеннями.

# Текст описує процес вдосконалення алгоритму використовуючи значення 1.247330950103979 як фактор зменшення.
step = int(len(random_list) / 1.247)
swap = 1
